## dev plan
```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # aws_acm_certificate.this[0] will be created
+   resource "aws_acm_certificate" "this" {
+       arn                       = (known after apply)
+       domain_name               = "argocd.cmcloudlab174.info"
+       domain_validation_options = [
+           {
+               domain_name           = "argocd.cmcloudlab174.info"
+               resource_record_name  = (known after apply)
+               resource_record_type  = (known after apply)
+               resource_record_value = (known after apply)
            },
        ]
+       id                        = (known after apply)
+       key_algorithm             = (known after apply)
+       not_after                 = (known after apply)
+       not_before                = (known after apply)
+       pending_renewal           = (known after apply)
+       renewal_eligibility       = (known after apply)
+       renewal_summary           = (known after apply)
+       status                    = (known after apply)
+       subject_alternative_names = [
+           "argocd.cmcloudlab174.info",
        ]
+       tags_all                  = (known after apply)
+       type                      = (known after apply)
+       validation_emails         = (known after apply)
+       validation_method         = "DNS"

+       options {
+           certificate_transparency_logging_preference = "ENABLED"
        }
    }

  # aws_acm_certificate_validation.this[0] will be created
+   resource "aws_acm_certificate_validation" "this" {
+       certificate_arn         = (known after apply)
+       id                      = (known after apply)
+       validation_record_fqdns = (known after apply)
    }

  # aws_route53_record.validation[0] will be created
+   resource "aws_route53_record" "validation" {
+       allow_overwrite = true
+       fqdn            = (known after apply)
+       id              = (known after apply)
+       name            = (known after apply)
+       records         = (known after apply)
+       ttl             = 60
+       type            = (known after apply)
+       zone_id         = "Z093870638O2TDQ27DZ9E"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   acm_certificate_arn                       = (known after apply)
+   acm_certificate_domain_validation_options = [
+       {
+           domain_name           = "argocd.cmcloudlab174.info"
+           resource_record_name  = (known after apply)
+           resource_record_type  = (known after apply)
+           resource_record_value = (known after apply)
        },
    ]
+   acm_certificate_status                    = (known after apply)
+   acm_certificate_validation_emails         = (known after apply)
+   distinct_domain_names                     = [
+       "argocd.cmcloudlab174.info",
    ]
+   validation_domains                        = (known after apply)
+   validation_route53_record_fqdns           = [
+       (known after apply),
    ]
```